"""
    复习
    ２０４８　核心算法
        1. 程序调用过程
        2. 降维思想(2 --> 1)

    函数参数
        实际参数
            位置实参 (1,2,3,4):按位置进行对应(实　－－> 形)
                序列实参(*序列):拆(实　－－> 形)
            关键字实参(b = "B"):按名称进行对应(实　－－> 形)
                字典关键字实参(**字典):拆(实　－－> 形)
        形式参数
            默认参数(a = 0,b ="",c = True):实参可以不传
            位置形参(a,b,c):实参必须传递
                星号元组形参(*args):合(位置实参 --> 元组)
            命名关键字形参(*args,a,b)
                        (a,*,b)
                        实参必须是关键字实参
                双星号字典形参(**kwargs):合(关键字实参 --> 字典)
"""
