"""
    复习
    语句
        选择
            if 条件:
                满足条件执行的代码
            else:
                不满足条件执行的代码

        循环
            while 条件:
                循环体
            else:
                不满足条件执行的代码

            for 变量 in 可迭代对象：
                循环体
                可迭代对象：容器(str/list....),

            range:整数生成器
                range(起点,终点,间隔)
                -- 不包含终点
                -- 起点默认0
                -- 间隔默认1
                -- 通过for获取整数

            for + range:预定次数
            while:已知条件

        跳转
            在循环内部使用
            break : 中断循环
            continue：跳过一次

    容器
        字符串str:存储字符编码,不可变序列.
        列表list:存储变量,可变序列.
"""












