"""
    函数内存分配
        可变／不可变类型在传参时的区别
"""


# 将函数代码存入内存方法区
def fun01():
    a = 100


# 调用函数在内存栈区开辟空间(栈帧)
fun01()


# 当函数执行完毕后，栈帧被销毁.


def fun02(p1, p2):
    # 改变fun02栈帧中的变量p1（没有修改传入的数据）
    p1 = 100
    # 改变变量p2指向的列表对象
    p2[0] = "A"


g01 = 1
g02 = ["a"]
# 将变量g01存储的对象地址传入函数
fun02(g01, g02)
print(g01)  # 1
print(g02[0])  # A


def fun03(p1, p2):
    # 改变变量p01指向的列表对象
    p1[:] = "悟空"
    # 创建栈帧中的变量l01
    l01 = p2[:]
    # 改变栈帧中的变量
    l01 = 500

g01 = ["孙悟空"]
g02 = ["猪八戒"]
fun03(g01, g02)
print(g01)  # 1
print(g02)  # ["猪八戒"]
