"""
    字符串通用操作
    练习：exercise07
"""

#1. 数学运算
str01 = "八戒"
str01 += "悟空"
print(str01)# 八戒悟空

# 重复生成容器元素
str01 *= 3
print(str01)# 八戒悟空八戒悟空八戒悟空

# 2.成员运算   元素 in  容器  --> bool
print("八戒" in str01)# true

# 3. 索引:定位单个元素
str02 = "我是齐天大圣孙悟空。"
print(str02[0])# 第一个字符
print(str02[-1])# 最后一个字符
# 正数第四个
print(str02[3])
# 倒数第三个
print(str02[-3])
# print(str02[50])# 索引不能超出界限  "索引越界"
# print(str02[-30])
# 4. 切片:定位多个元素   容器名[起点:终点:间隔]
print(str02[2:6:1])# 齐天大圣
print(str02[0:2])# 我是
print(str02[:2])# 我是
print(str02[-4:-1])# 孙悟空
print(str02[-4:])# 孙悟空
print(str02[:])#我是齐天大圣孙悟空。
print(str02[-2:-5:-1])#空悟孙
print(str02[::-1])#。空悟孙圣大天齐是我
print(str02[1:1])# 空的
print(str02[3:1])# 空的
print(str02[3:1:-1])# 天齐
print(str02[-2:3:-1])# 空悟孙圣大
print(str02[::2])# 我齐大孙空
# 练习: “我是明教教主张无忌”
# 打印第一个字符
# 打印最后一个字符
# 打印最后一个字符
# 打印中间的字符
# 打印前三个字符
# 打印后三个字符
# 打印 我教张
# 忌张教明我
# ...
