"""
    经理："曹操","刘备","孙权"
    技术员："曹操","刘备","张飞","关羽"

    计算：
    1. 是经理也是技术员的都有谁？
    2. 是经理也不是技术员的都有谁？
    3. 不是经理也是技术员的都有谁？
    4. 张飞是不是经理？
    5. 身兼一职的都有谁？
    6. 公司总共有几个人?
"""
# 字典 + 集合
dict_person = {
    "经理": {"曹操", "刘备", "孙权"},
    "技术员": {"曹操", "刘备", "张飞", "关羽"}
}
# 1.是经理也是技术员的都有谁？  交集
print(dict_person["经理"] & dict_person["技术员"])
# 16:50 上课
# 2.是经理也不是技术员的都有谁？ 补集
print(dict_person["经理"] - dict_person["技术员"])

# 3.不是经理也是技术员的都有谁？ 补集
print(dict_person["技术员"] - dict_person["经理"])

# 4.张飞是不是经理？
print("张飞" in dict_person["经理"])

# 5.身兼一职的都有谁？
print(dict_person["经理"] ^ dict_person["技术员"])

# 6.公司总共有几个人?  并集
print(len(dict_person["经理"] | dict_person["技术员"]))


