"""
3. 定义数据结构，存储以下数据。
    (1) 多个人的多个爱好
        qtx:编码,看书,跑步
        悟空:刷抖音,飞翔
        八戒:美食,美女,睡觉
    (2) 多个城市的多个景区与美食
        "北京":
            "景区":"故宫","天安门","长城"
            "美食":"烤鸭","豆汁"
         "四川":
            "景区":"九寨沟","峨眉山"
            "美食":"火锅","老妈兔头"
        -- 打印北京美食(一行一个)
        -- 打印所有城市(一行一个)
        -- 打印所有城市的景区(一行一个)

"""

# (1) 多个人的多个爱好
dict_hobbys = {
    "qtx": ["编码", "看书", "跑步"],
    "悟空": ["刷抖音", "飞翔"],
    "八戒": ["美食", "美女", "睡觉"]
}
# (2)多个城市的多个景区与美食
dict_info = {
    "北京":
        {
            "景区": ["故宫", "天安门", "长城"],
            "美食": ["烤鸭", "豆汁"]
        },
    "四川":
        {
            "景区": ["九寨沟", "峨眉山"],
            "美食": ["火锅", "老妈兔头"]
        }
}
# -- 打印所有城市(一行一个)
for key in dict_info:
    print(key)

# -- 打印北京美食(一行一个)
for item in dict_info["北京"]["美食"]:
    print(item)

# -- 打印所有城市的景区(一行一个)
for city in dict_info:
    for item in dict_info[city]["景区"]:
        print(item)
